{
  "backend/main.mo": "Defines actor with authorization and blob storage mixins managing listings, edit/delete requests, user profiles, and listing ID generation.",
  "feature_evidence.json": "Feature evidence report mapping multi-select location filter updates to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file including components, hooks, pages, and utilities.",
  "frontend/index.css": "Tailwind-based global style tokens defining color variables and theming for light and dark modes.",
  "frontend/index.html": "Base HTML entry point loading the React application and mounting it to the root div.",
  "frontend/src/App.tsx": "Sets up the TanStack Router route tree and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and error handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter their name and select a role before continuing.",
  "frontend/src/components/auth/RoleGate.tsx": "Route guard that blocks access based on authentication and required role, showing an access denied message.",
  "frontend/src/components/layout/AppShell.tsx": "App layout wrapper rendering header, footer, and the active routed page.",
  "frontend/src/components/layout/Footer.tsx": "Renders a footer with current year, branding, and a Caffeine.ai credit link.",
  "frontend/src/components/layout/Header.tsx": "Displays the site header with navigation links and conditional dashboard options based on user role.",
  "frontend/src/components/listings/FiltersPanel.tsx": "Provides interactive filters for listings including price, location, type, facilities, and rental durations.",
  "frontend/src/components/listings/ListingCard.tsx": "Shows a clickable card preview of a listing with photo, type badge, location, and price.",
  "frontend/src/components/listings/ListingForm.tsx": "Form for creating or editing listings, handling title, price, location, type, facilities, durations, and description.",
  "frontend/src/components/listings/PhotoGallery.tsx": "Displays listing photos with thumbnails and a modal viewer supporting navigation.",
  "frontend/src/components/moderation/EditRequestDiff.tsx": "Compares original and edited listing fields, highlighting changes with side‑by‑side views.",
  "frontend/src/components/photos/PhotoManager.tsx": "Manages photo uploads, previews, removal, and upload progress for listings.",
  "frontend/src/hooks/useActor.ts": "Creates and caches backend actors based on identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useAuth.ts": "Provides hooks for fetching and updating the caller’s profile and role, and exposes login/logout utilities.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, handling identity loading, login, logout, and status management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on listings, photos, and moderation requests using the backend actor.",
  "frontend/src/index.css": "Sets global Tailwind styles and defines a blue-themed light/dark design system via CSS variables.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/admin/AdminAllListingsPage.tsx": "Shows all listings for admins with status badges and actions to approve pending listings. Provides links to view details and create new listings.",
  "frontend/src/pages/admin/AdminCreateListingPage.tsx": "Admin form page to create new listings with validation, photo uploads, and submission logic. On success it navigates back to the admin dashboard.",
  "frontend/src/pages/admin/AdminRequestsQueuePage.tsx": "Displays moderation queues for edit and delete requests, allowing admins to approve or reject with reasons. Uses tabs to switch between edit and delete request lists.",
  "frontend/src/pages/AdminDashboardLayout.tsx": "Admin layout with navigation and role gating for managing listings and requests.",
  "frontend/src/pages/ListingDetailPage.tsx": "Displays detailed listing information including photos, pricing, facilities, and rental options.",
  "frontend/src/pages/owner/OwnerCreateListingPage.tsx": "Owner-facing page to create new listings with form inputs and photo uploads. Submits listing data and returns to the owner dashboard on success.",
  "frontend/src/pages/owner/OwnerEditRequestPage.tsx": "Allows owners to request edits to an existing listing by preloading current data and submitting revised fields and photos. Sends an edit request for admin approval.",
  "frontend/src/pages/owner/OwnerMyListingsPage.tsx": "Shows listings belonging to the logged‑in owner with status indicators and actions to view or request edits. Encourages creation of a listing if none exist.",
  "frontend/src/pages/owner/OwnerRequestsPage.tsx": "Displays the logged-in owner's edit and delete requests with status badges and optional rejection reasons.",
  "frontend/src/pages/OwnerDashboardLayout.tsx": "Owner dashboard layout with role-gated navigation for managing personal listings and requests.",
  "frontend/src/pages/PublicListingsPage.tsx": "Displays public listings with search, filtering, sorting, and pagination, showing only approved listings. Uses memoized filtering logic and UI controls for location, price, facilities, and more.",
  "frontend/src/utils/format.ts": "Provides helper functions to format numbers as Indonesian Rupiah and parse Rupiah strings into numbers.",
  "frontend/src/utils/imageValidation.ts": "Validates uploaded images by checking MIME type and enforcing a 5MB size limit.",
  "frontend/src/utils/urlParams.ts": "Utility for reading URL parameters, persisting them in sessionStorage, and managing hash-based query parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, container settings, and enabling plugins like typography and container queries.",
  "project_state.json": "Describes the project state, features, architecture notes, and known issues for a property listing application."
}